{
  "backend/main.mo": "Motoko canister handling user profiles, booking leads, and rate card upload with access control and blob storage integration.",
  "feature_evidence.json": "Feature evidence report describing updates to the frontend rate card display and associated components.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short functional descriptions.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens and styling for light and dark modes.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component managing authentication state and routing between login, booking, leads, and rate card pages.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, navigation, logout handling, and responsive mobile/desktop navigation.",
  "frontend/src/components/BrandLogo.tsx": "Simple component rendering square or wide variants of the BISMI CABS logo.",
  "frontend/src/components/RatePricingSection.tsx": "Component displaying multiple pricing sections including current rates, additional info, local transfer, and rental rate card tables/cards.",
  "frontend/src/hooks/useActor.ts": "Hook that constructs an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, status tracking, and restoring identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch and mutate booking leads, rate cards, and admin status using an actor.",
  "frontend/src/index.css": "Configures Tailwind CSS and custom theme variables for light and dark modes with cab service branding.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/BookingFormPage.tsx": "Implements a booking form with validation, submission via mutation, and authentication gating.",
  "frontend/src/pages/LeadsPage.tsx": "Displays authenticated booking leads with loading, error handling, and formatted lead details.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen using Internet Identity and provides navigation options after authentication.",
  "frontend/src/pages/RateCardPage.tsx": "Provides a rate card page with authentication, file upload using progress tracking, and download functionality, plus admin checks and pricing display.",
  "frontend/src/utils/download.ts": "Creates a blob from bytes and triggers a browser download via a temporary link.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters, persisting them in sessionStorage, and removing parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing implemented features, versioning, and current state of the BISMI CABS website."
}