{
  "backend/main.mo": "Motoko canister implementing user profiles, booking leads, authorization checks, blob storage, and rate‑card upload logic.",
  "feature_evidence.json": "Feature evidence record listing a profile-page update requirement and its associated files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend files used in the project.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and theme tokens for light and dark modes.",
  "frontend/index.html": "Basic HTML entry file mounting the React root element and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling routing, deep-linking logic, authentication states, and backend actor initialization.",
  "frontend/src/components/AppShell.tsx": "Layout wrapper providing header, navigation, account menu, share dialog, and conditional owner-mode leads access.",
  "frontend/src/components/BrandLogo.tsx": "Simple component rendering square or wide logo variants from static assets.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a fallback UI with reload option and error details when uncaught errors occur.",
  "frontend/src/components/OwnerNotAuthorizedCard.tsx": "Shows an unauthorized access message, displays the user's principal ID with copy support, and optionally links to booking or rate card pages.",
  "frontend/src/components/RatePricingSection.tsx": "Renders pricing tables for hourly, local transfer, and rental rates along with important notes and additional rate info.",
  "frontend/src/components/ShareAppLinkCard.tsx": "Displays customer and owner shareable URLs with copy and open actions, providing separate links for bookings and admin access.",
  "frontend/src/components/TripTotalCalculator.tsx": "Calculates trip cost based on vehicle type, trip type, distance, and rates, showing a breakdown when distance is entered.",
  "frontend/src/components/UserAvatar.tsx": "Loads and displays the caller’s profile avatar with a fallback image and icon.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Initializes a backend actor with optional admin token setup, exposes actor state, and manages query invalidation and warnings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity login, logout, and identity loading using AuthClient.",
  "frontend/src/hooks/useLocalStorage.ts": "React hook for reading and writing values to localStorage with SSR-safe checks and JSON serialization.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks that wrap backend actor calls for booking leads, rate cards, user profile management, and authorization checks.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global styling.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up QueryClient, and wraps the app with InternetIdentityProvider.",
  "frontend/src/pages/BookingFormPage.tsx": "Page component rendering a booking form with validation and submission to create a booking lead.",
  "frontend/src/pages/LeadsPage.tsx": "Page for viewing booking leads with polling, role-based authorization, notification sounds, and localStorage state.",
  "frontend/src/pages/LoginPage.tsx": "Login page handling Internet Identity auth, app mode logic, and navigation buttons based on user role.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page allowing users to initialize profiles, upload display pictures, and copy shareable links.",
  "frontend/src/pages/RateCardPage.tsx": "Rate card page enabling authenticated users to view pricing details and admins to upload or download rate card files.",
  "frontend/src/utils/appMode.ts": "Utility for determining, getting, and setting the app mode between customer and owner.",
  "frontend/src/utils/canonicalUrl.ts": "Generates canonical shareable URLs with optional mode and deep-link parameters and supports clipboard copying.",
  "frontend/src/utils/download.ts": "Provides a helper to trigger browser downloads for binary files.",
  "frontend/src/utils/mapBackendError.ts": "Maps backend error messages into user-friendly strings with categorized handling.",
  "frontend/src/utils/rates.ts": "Centralized rate constants and helper functions for vehicle pricing, allowances, and trip calculations.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session parameters with hash and query support.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining content paths, theme extensions, custom colors, fonts, animations, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, and new feature requests for persisting user profile photos."
}