{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, booking lead creation, and rate card storage with admin/staff authorization checks.",
  "feature_evidence.json": "Report describing a feature fix related to one‑way trip pricing with referenced frontend files and components.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to their descriptions for documentation or build planning.",
  "frontend/index.css": "Global Tailwind-based OKLCH color theme definitions for light and dark modes with shared design tokens.",
  "frontend/index.html": "Basic HTML entry page loading the React app through main.tsx.",
  "frontend/src/App.tsx": "Main React app managing routing, mode-based behavior (owner/customer), authentication flow, and actor initialization states.",
  "frontend/src/components/AppShell.tsx": "Layout shell with header, navigation, share dialog, and auth-aware menu options for owner and customer modes.",
  "frontend/src/components/BrandLogo.tsx": "Simple logo component rendering square or wide variants of the BISMI CABS asset.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that displays a styled fallback UI with reload option and error details.",
  "frontend/src/components/OwnerNotAuthorizedCard.tsx": "Displays an unauthorized access message, shows the user’s principal ID with copy support, and offers optional navigation buttons.",
  "frontend/src/components/RatePricingSection.tsx": "Renders pricing tables and notes for hourly, local transfer, and rental vehicle rates using predefined rate constants.",
  "frontend/src/components/ShareAppLinkCard.tsx": "Provides customer and owner URLs with copy-to-clipboard and open-link actions for sharing the app.",
  "frontend/src/components/TripTotalCalculator.tsx": "Calculates estimated trip cost based on vehicle type, trip type, and distance, showing a cost breakdown.",
  "frontend/src/components/UserAvatar.tsx": "Displays the logged-in user’s profile picture or a fallback avatar using profile data from a query hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useBackendActor.ts": "Builds an authenticated or anonymous backend actor with optional admin initialization and exposes loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, and persisted identity loading.",
  "frontend/src/hooks/useLocalStorage.ts": "Custom React hook for reading and writing typed values to localStorage with SSR safety.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend actor operations such as booking leads, admin checks, rate card actions, and user profile handling.",
  "frontend/src/index.css": "Tailwind CSS configuration defining light and dark theme variables and base styles.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up the QueryClient, and wraps the app with the InternetIdentityProvider.",
  "frontend/src/pages/BookingFormPage.tsx": "Booking form page that validates input and submits new booking leads, showing success and error states.",
  "frontend/src/pages/LeadsPage.tsx": "Leads management page that fetches booking leads, checks admin/authorization, handles polling, notifications, and displays lead details.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login UI, manages Internet Identity authentication, and conditionally shows navigation buttons based on app mode and admin status.",
  "frontend/src/pages/ProfilePage.tsx": "Provides profile initialization and display picture upload with validation, preview, progress tracking, and error handling.",
  "frontend/src/pages/RateCardPage.tsx": "Displays rate pricing, allows authenticated admins to upload a rate card, and lets users download the latest stored file.",
  "frontend/src/utils/appMode.ts": "Determines, retrieves, and persists the app’s customer/owner mode using URL or session state.",
  "frontend/src/utils/canonicalUrl.ts": "Generates shareable canonical URLs with optional mode and deep-link parameters and copies them to the clipboard.",
  "frontend/src/utils/download.ts": "Creates a Blob from bytes and triggers a browser download for a given filename and content type.",
  "frontend/src/utils/mapBackendError.ts": "Maps backend error messages to user-friendly text, categorizing common authorization, profile, file, and network issues.",
  "frontend/src/utils/rates.ts": "Defines vehicle rate constants and helper functions for calculating per‑km rates, allowances, hourly rates, and billable distance.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routes), persist them in sessionStorage, and clear them from either storage or the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and extended theme values.",
  "project_state.json": "JSON metadata describing the project state, known issues, and a fix request for correcting one-way trip fare calculations."
}