{
  "backend/main.mo": "Motoko backend providing user profiles, rate card uploads, booking lead creation, and permission‑guarded access using AccessControl and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Collection of short summaries describing the purpose and behavior of each frontend source file.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color tokens, dark mode overrides, and global styling utilities.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main app component handling routing, deep-links, mode‑based redirects, actor initialization, and error states.",
  "frontend/src/components/AppShell.tsx": "Application shell with header, navigation, share dialog, and mode‑aware visibility for leads and profile options.",
  "frontend/src/components/BrandLogo.tsx": "Simple logo component rendering square or wide brand images from static assets.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a styled fallback UI with reload and support contact options.",
  "frontend/src/components/OwnerNotAuthorizedCard.tsx": "Displays an authorization error card showing the user's principal ID with copy support and optional navigation buttons.",
  "frontend/src/components/RatePricingSection.tsx": "Renders pricing tables and notes for vehicle rates, hourly rates, local transfers, rentals, and additional trip info.",
  "frontend/src/components/ShareAppLinkCard.tsx": "Provides customer and owner shareable app links with copy and open actions in a styled card.",
  "frontend/src/components/TripTotalCalculator.tsx": "Interactive calculator that computes trip cost based on vehicle type, trip type, distance, and driver allowance.",
  "frontend/src/components/UserAvatar.tsx": "Displays the current user's avatar or fallback icon using profile data from a query hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Enhanced actor hook that handles authenticated/anonymous actors, optional admin initialization, and reports errors and warnings.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication via AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useLocalStorage.ts": "A React hook that syncs state with localStorage safely in SSR environments.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for backend actor calls including leads, admin checks, rate card operations, and user profile actions.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark mode theme variables for the app.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/BookingFormPage.tsx": "A form page for creating booking leads with validation, submission handling, and success alerts.",
  "frontend/src/pages/LeadsPage.tsx": "Displays booking leads with polling, admin/authorization checks, localStorage settings, and optional notification sounds.",
  "frontend/src/pages/LoginPage.tsx": "Login page managing Internet Identity auth, app mode routing, and navigation buttons for booking, leads, rate card, and profile.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page allowing users to initialize a profile and upload a display picture with validation and progress tracking.",
  "frontend/src/pages/RateCardPage.tsx": "Rate card page enabling authenticated users to view pricing, download the latest rate card, and admins to upload new files.",
  "frontend/src/utils/appMode.ts": "Utilities for reading and persisting the app’s customer/owner mode from URL or session storage.",
  "frontend/src/utils/canonicalUrl.ts": "Generates shareable canonical URLs with optional mode and deep-link parameters and supports copying them to the clipboard.",
  "frontend/src/utils/download.ts": "Creates a blob URL to trigger client‑side file downloads.",
  "frontend/src/utils/mapBackendError.ts": "Maps backend error messages to user‑friendly strings for display while preserving raw error details.",
  "frontend/src/utils/rates.ts": "Defines vehicle rate constants and helper functions for per‑km, hourly, and allowance calculations.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and managing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "TailwindCSS config enabling dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Project state file defining metadata, existing features, and pending feature requests for customer booking link behavior."
}