{
  "backend/main.mo": "Motoko canister implementing user profiles, booking leads, and rate card upload with strict admin/user authorization and blob storage integration.",
  "feature_evidence.json": "Feature evidence report linking UI access-control features to corresponding frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Aggregated summaries describing the purpose of major frontend components, pages, hooks, and utilities in the app.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens for the app’s light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication, actor initialization, and routing between login, booking, leads, and rate card pages.",
  "frontend/src/components/AppShell.tsx": "Layout shell with header, footer, navigation, share dialog, and conditional admin-only access to the Leads section.",
  "frontend/src/components/BrandLogo.tsx": "Simple component that displays the square or wide BISMI CABS logo from static assets.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches render errors and shows a styled recovery screen with reload support.",
  "frontend/src/components/RatePricingSection.tsx": "Renders pricing tables and cards for various vehicle types, additional info, local transfer, and rental rates with responsive layouts.",
  "frontend/src/components/ShareAppLinkCard.tsx": "Displays the site's canonical URL with buttons to copy it or open it in a new tab, including copy feedback state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context using Internet Identity, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for booking leads, rate cards, uploads, and admin checks using the backend actor.",
  "frontend/src/index.css": "Tailwind config with custom light and dark theme variables for a cab-service style UI.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/BookingFormPage.tsx": "Implements a validated booking form requiring Internet Identity login and submits new leads via backend mutations.",
  "frontend/src/pages/LeadsPage.tsx": "Admin-only leads page that handles authentication, permission checks, and displays booking leads with loading and error states.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity that shows login controls and navigation options, including admin-only leads access.",
  "frontend/src/pages/RateCardPage.tsx": "Rate card page that allows authenticated admins to upload and download rate card files and view pricing sections.",
  "frontend/src/utils/canonicalUrl.ts": "Generates a canonical shareable app URL, optionally including canisterId, and provides a helper to copy it to the clipboard.",
  "frontend/src/utils/download.ts": "Utility to download a given byte array as a file by creating a Blob and triggering a browser download.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters from query strings or hash routes using sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color variables, typography, animations, and scanning paths.",
  "project_state.json": "Project state file describing current BISMI CABS website features, branding tasks, booking/leads functionality, and architectural notes. Includes known issues, role-based access needs, and a list of existing feature records with versions and requirement IDs."
}