{
  "kind": "build_request",
  "title": "Restrict Leads page visibility so customer shared link shows only New Booking and Rate Card",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Hide all UI entry points to the \"Leads\" page for non-admin users so that customers who open the shared website link only see \"New Booking\" and \"Rate Card\" navigation/actions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "I share to costmer link just open link just show new booking & rate card only don't show booking lead page ok booking lead page only for me ok"
        ]
      },
      "acceptanceCriteria": [
        "When a non-admin authenticated user views the app, the bottom navigation (mobile) does not show the \"Leads\" tab.",
        "When a non-admin authenticated user views the app, the desktop navigation does not show the \"View Leads\" button.",
        "When a non-admin authenticated user is on the Login/Home page while authenticated, the \"View All Leads\" button is not shown.",
        "Admin users continue to see the Leads navigation/actions as before."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Prevent non-admin users from accessing the Leads page even if they manually navigate to it (e.g., via any UI state or deep link), and show an English \"Not authorized\" message with clear buttons to go to \"New Booking\" and \"Rate Card\" instead.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "don't show booking lead page ok booking lead page only for me ok"
        ]
      },
      "acceptanceCriteria": [
        "If a non-admin user attempts to open the Leads page, the app does not display lead data and instead shows a \"Not authorized\" message in English.",
        "The \"Not authorized\" state includes a button to navigate to \"New Booking\" and a button to navigate to \"Rate Card\".",
        "Admin users can access the Leads page normally without seeing the \"Not authorized\" state."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Keep Internet Identity authentication as-is.",
    "Do not change backend authorization logic unless required to implement the UI restriction (prefer frontend-only gating using the existing admin check hook)."
  ],
  "nonGoals": [
    "Implementing a new authentication system or username/password login.",
    "Adding new pages beyond restricting access to the existing Leads page.",
    "Changing booking creation flow or rate card upload/download behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}