{
  "kind": "build_request",
  "title": "Customer share link opens booking directly without requiring login",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Allow customer-mode users to open the Booking page directly from a shared customer link even when they are not logged in (no forced redirect to the Login page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Costmer  link without login direct to booking pls update that type of link"
        ]
      },
      "acceptanceCriteria": [
        "When visiting the customer share link in a fresh/incognito browser session (not logged in), the app shows the Booking page instead of the Login page.",
        "Owner mode behavior remains unchanged: visiting the owner link while not logged in shows the Login page / requires Internet Identity sign-in."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the customer share link generation so it produces a URL that deep-links into the Booking flow (e.g., includes a parameter that the app uses to open the booking page on load).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Costmer  link without login direct to booking pls update that type of link"
        ]
      },
      "acceptanceCriteria": [
        "The Customer Link shown in `frontend/src/components/ShareAppLinkCard.tsx` generates a URL that opens the Booking page directly on first load.",
        "Copy Link and Open actions for the customer link use the updated deep-link URL.",
        "The Owner Link continues to generate an owner-mode URL and does not deep-link to customer booking."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make the booking form usable without Internet Identity login in customer mode, including enabling submission when the visitor is anonymous.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Costmer  link without login direct to booking pls update that type of link"
        ]
      },
      "acceptanceCriteria": [
        "On the Booking page while not logged in, the booking form fields and “Create Booking” submission are available (no “Authentication Required” blocking screen).",
        "Submitting a booking as an anonymous visitor successfully creates a booking lead and shows the existing success UI state.",
        "Backend no longer traps with an authorization error for anonymous callers of `createBookingLead` (it should accept anonymous/guest callers for booking creation).",
        "Admin/owner-only access to view all leads remains protected (non-admin/non-authorized callers still cannot access `getBookingLeads`)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional services).",
    "Do not edit files under `frontend/src/components/ui` or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Adding external databases or third-party backend services.",
    "Implementing real-time updates (WebSockets/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}