{
  "kind": "build_request",
  "title": "Persist profile photo (display picture) permanently across upgrades",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Persist each user’s profile (including the uploaded display picture reference) in stable storage so the profile photo remains saved after canister upgrades/redeploys.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Upload this profile photo permanent"
        ]
      },
      "acceptanceCriteria": [
        "After a user uploads a display picture, reloading the app still shows the same display picture for that user.",
        "After a canister upgrade/redeploy, the previously uploaded display picture is still present when calling getCallerUserProfile for the same principal.",
        "The solution uses stable persistence (e.g., stable vars + preupgrade/postupgrade) rather than in-memory-only Maps, for the userProfiles data."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Profile page success messaging (English) to clearly indicate that the uploaded display picture is saved to the user profile permanently and will remain available next time they sign in.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Upload this profile photo permanent"
        ]
      },
      "acceptanceCriteria": [
        "After a successful upload, the UI displays an English success message that explicitly states the photo is saved permanently (wording may vary but must be unambiguous).",
        "No changes are made to any frontend immutablePaths (e.g., useInternetIdentity/useActor/main.tsx and components/ui)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only Internet Identity authentication is supported; do not add third-party auth.",
    "Do not edit files under frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Add Open Graph / link preview images for WhatsApp/Facebook sharing.",
    "Implement image editing/cropping/compression workflows beyond the existing upload validation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}