{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend-only admin gating for Leads navigation and access",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Hide all UI entry points to the Leads page for non-admin users while keeping Leads visible for admins.",
      "acceptanceCriteria": [
        "When a non-admin authenticated user views the app, the bottom navigation (mobile) does not show the \"Leads\" tab.",
        "When a non-admin authenticated user views the app, the desktop navigation does not show the \"View Leads\" button.",
        "When a non-admin authenticated user is on the Login/Home page while authenticated, the \"View All Leads\" button is not shown.",
        "Admin users continue to see the Leads navigation/actions as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Conditionally render the mobile \"Leads\" tab and the desktop \"View Leads\" button only when the current user is an admin (use the authorization capability via the existing admin check hook, e.g., useIsCallerAdmin). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Hide the authenticated \"View All Leads\" button for non-admin users by checking admin status (use the authorization capability via the existing admin check hook, e.g., useIsCallerAdmin). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Block non-admin access to the Leads page and show a Not authorized message with navigation buttons to New Booking and Rate Card.",
      "acceptanceCriteria": [
        "If a non-admin user attempts to open the Leads page, the app does not display lead data and instead shows a \"Not authorized\" message in English.",
        "The \"Not authorized\" state includes a button to navigate to \"New Booking\" and a button to navigate to \"Rate Card\".",
        "Admin users can access the Leads page normally without seeing the \"Not authorized\" state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the booking leads query hook to support conditional fetching (e.g., accept an enabled flag/options) so the Leads data query can be disabled when the user is not an admin, preventing any lead data from loading for non-admins. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LeadsPage.tsx",
          "operation": "modify",
          "description": "Add an admin gate using the existing admin check hook (authorization capability) and render an English \"Not authorized\" UI for non-admins that includes two clear buttons: one to navigate to \"New Booking\" and one to navigate to \"Rate Card\". Ensure lead data fetching is disabled unless admin. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire navigation into the Leads page by passing the existing onNavigate/setCurrentPage handler into LeadsPage so the unauthorized state buttons can route users to \"booking\" (New Booking) and \"rateCard\" (Rate Card) without adding new pages."
        }
      ]
    }
  ]
}